package src.java_2018;

import java.util.Scanner;

/*
一个字节可以存储8位信息，用32个字节就可以存一个汉字的字形了”。
把每个字节转为2进制表示，1表示墨迹，0表示底色。每行2个字节,
一共16行， 布局是:
第1字节，第2字节
第3字节，第4字节
第31字节，第32字节
这道题目是给你一段多个汉字组成的信息，每个汉字用32个字节表示，这里给出了宁节作为有符号整数的值
题目的要求隐藏在这些信息中。你的任务是复原这些汉字的字形，从中看出题目的要求，并根据要求填写答案。
这段信息是(一共10个汉字) :
4 0 4 0 4 0 4 32 -1 -16 4 32 4 32 4 32 4 32 4 32 8 32 8 32 16 34 16 34 32 30 -64 0
16 64 16 64 36 812712666-12467466466-1241261006636664664664126466400I6
404040432-1-16432432432432 432832 832 16 34 16 34 32 30 -64 0
0-12864-12848-12281781--42888016643264-326432--9632-9633163483614404
40301004-1-2.404167-8416416416816816161632-966464
1664207262-473325161063-810-1-206408063-88644641640-I28
01663-8.1.0101014-1.-21010.1010I01.0105020
20207-16832246437-1.282-12812-1.28113-4281216I83233-64I01401120
1010109329161712174331665161321640-128I0201201120
00007-162424481256120560-320-640-1280000I-1283-64I-12800

 */
public class _05明码 {
    public static void main(String[] args) {

        Scanner sc = new Scanner(System.in);

        int x, y;
        for (int i = 0; i < 1; i++) {
            //10行   每一行 16个数字
            for (int j = 0; j < 16; j++) {
                x = sc.nextInt();
                y = sc.nextInt();

                String xx = "-----", yy = "-----";
                xx = Integer.toBinaryString(x);
                yy = Integer.toBinaryString(y);
                System.out.println(xx+""+yy);

            }

        }


        /*long ans = 9;
        for (int i = 0; i < 8; i++) {

            ans *= 9;
        }
        System.out.println(ans);*/
    }
}
